NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32MG24/EFR32MG24A121F1536GM48.svd
        <register>
          <name>ASYNC_CH5_CTRL</name>
          <description>No Description</description>
          <addressOffset>0x02C</addressOffset>
          <access>read-write</access>
          <resetValue>0x000C0000</resetValue>
          <resetMask>0x0F0F7F07</resetMask>
          <fields>
            <field>
              <name>SIGSEL</name>
              <description>Signal Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SOURCESEL</name>
              <description>Source Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FNSEL</name>
              <description>Function Select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOGICAL_ZERO</name>
                  <description>Logical 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_NOR_B</name>
                  <description>A NOR B</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_A_AND_B</name>
                  <description>(!A) AND B</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_A</name>
                  <description>!A</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_AND_NOT_B</name>
                  <description>A AND (!B)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_B</name>
                  <description>!B</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_XOR_B</name>
                  <description>A XOR B</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_NAND_B</name>
                  <description>A NAND B</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_AND_B</name>
                  <description>A AND B</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_XNOR_B</name>
                  <description>A XNOR B</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B</name>
                  <description>B</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_A_OR_B</name>
                  <description>(!A) OR B</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A</name>
                  <description>A</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_OR_NOT_B</name>
                  <description>A OR (!B)</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_OR_B</name>
                  <description>A OR B</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOGICAL_ONE</name>
                  <description>Logical 1</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUXSEL</name>
              <description>Aux Select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ASYNC_CH6_CTRL</name>
          <description>No Description</description>
          <addressOffset>0x030</addressOffset>
          <access>read-write</access>
          <resetValue>0x000C0000</resetValue>
          <resetMask>0x0F0F7F07</resetMask>
          <fields>
            <field>
              <name>SIGSEL</name>
              <description>Signal Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SOURCESEL</name>
              <description>Source Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FNSEL</name>
              <description>Function Select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOGICAL_ZERO</name>
                  <description>Logical 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_NOR_B</name>
                  <description>A NOR B</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_A_AND_B</name>
                  <description>(!A) AND B</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_A</name>
                  <description>!A</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_AND_NOT_B</name>
                  <description>A AND (!B)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_B</name>
                  <description>!B</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_XOR_B</name>
                  <description>A XOR B</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_NAND_B</name>
                  <description>A NAND B</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_AND_B</name>
                  <description>A AND B</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_XNOR_B</name>
                  <description>A XNOR B</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B</name>
                  <description>B</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_A_OR_B</name>
                  <description>(!A) OR B</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A</name>
                  <description>A</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_OR_NOT_B</name>
                  <description>A OR (!B)</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_OR_B</name>
                  <description>A OR B</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOGICAL_ONE</name>
                  <description>Logical 1</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUXSEL</name>
              <description>Aux Select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ASYNC_CH7_CTRL</name>
          <description>No Description</description>
          <addressOffset>0x034</addressOffset>
          <access>read-write</access>
          <resetValue>0x000C0000</resetValue>
          <resetMask>0x0F0F7F07</resetMask>
          <fields>
            <field>
              <name>SIGSEL</name>
              <description>Signal Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SOURCESEL</name>
              <description>Source Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FNSEL</name>
              <description>Function Select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOGICAL_ZERO</name>
                  <description>Logical 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_NOR_B</name>
                  <description>A NOR B</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_A_AND_B</name>
                  <description>(!A) AND B</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_A</name>
                  <description>!A</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_AND_NOT_B</name>
                  <description>A AND (!B)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_B</name>
                  <description>!B</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_XOR_B</name>
                  <description>A XOR B</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_NAND_B</name>
                  <description>A NAND B</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_AND_B</name>
                  <description>A AND B</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_XNOR_B</name>
                  <description>A XNOR B</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B</name>
                  <description>B</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_A_OR_B</name>
                  <description>(!A) OR B</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A</name>
                  <description>A</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_OR_NOT_B</name>
                  <description>A OR (!B)</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_OR_B</name>
                  <description>A OR B</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOGICAL_ONE</name>
                  <description>Logical 1</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUXSEL</name>
              <description>Aux Select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ASYNC_CH8_CTRL</name>
          <description>No Description</description>
          <addressOffset>0x038</addressOffset>
          <access>read-write</access>
          <resetValue>0x000C0000</resetValue>
          <resetMask>0x0F0F7F07</resetMask>
          <fields>
            <field>
              <name>SIGSEL</name>
              <description>Signal Select</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NONE</name>
                  <description></description>
                  <value>0</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SOURCESEL</name>
              <description>Source Select</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FNSEL</name>
              <description>Function Select</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>LOGICAL_ZERO</name>
                  <description>Logical 0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_NOR_B</name>
                  <description>A NOR B</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_A_AND_B</name>
                  <description>(!A) AND B</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_A</name>
                  <description>!A</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_AND_NOT_B</name>
                  <description>A AND (!B)</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_B</name>
                  <description>!B</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_XOR_B</name>
                  <description>A XOR B</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_NAND_B</name>
                  <description>A NAND B</description>
                  <value>7</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_AND_B</name>
                  <description>A AND B</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_XNOR_B</name>
                  <description>A XNOR B</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>B</name>
                  <description>B</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NOT_A_OR_B</name>
                  <description>(!A) OR B</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A</name>
                  <description>A</description>
                  <value>12</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_OR_NOT_B</name>
                  <description>A OR (!B)</description>
                  <value>13</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>A_OR_B</name>
                  <description>A OR B</description>
                  <value>14</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOGICAL_ONE</name>
                  <description>Logical 1</description>
                  <value>15</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AUXSEL</name>
              <description>Aux Select</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
