NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/EFR32MG24/EFR32MG24A121F1536GM48.svd
        <register>
          <name>FENOTCHFILT2</name>
          <description>No Description</description>
          <addressOffset>0x138</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3FFF3FFF</resetMask>
          <fields>
            <field>
              <name>FENOTCHATTNSEL5</name>
              <description>FE Notch attn sel code for index 5</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPCRSE5</name>
              <description>FE Notch coarse cap code for index 5</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPFINE5</name>
              <description>FE Notch fine cap code for index 5</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHRATTNEN5</name>
              <description>FE notch rattn enable for index 5</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHEN5</name>
              <description>FE notch enable for index 5</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHATTNSEL6</name>
              <description>FE Notch attn sel code for index 6</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPCRSE6</name>
              <description>FE Notch coarse cap code for index 6</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPFINE6</name>
              <description>FE Notch fine cap code for index 6</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHRATTNEN6</name>
              <description>FE notch rattn enable for index 6</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHEN6</name>
              <description>FE notch enable for index 6</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FENOTCHFILT3</name>
          <description>No Description</description>
          <addressOffset>0x13C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3FFF3FFF</resetMask>
          <fields>
            <field>
              <name>FENOTCHATTNSEL7</name>
              <description>FE Notch attn sel code for index 7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPCRSE7</name>
              <description>FE Notch coarse cap code for index 7</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPFINE7</name>
              <description>FE Notch fine cap code for index 7</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHRATTNEN7</name>
              <description>FE notch rattn enable for index 7</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHEN7</name>
              <description>FE notch enable for index 7</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHATTNSEL8</name>
              <description>FE Notch attn sel code for index 8</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPCRSE8</name>
              <description>FE Notch coarse cap code for index 8</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPFINE8</name>
              <description>FE Notch fine cap code for index 8</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHRATTNEN8</name>
              <description>FE notch rattn enable for index 8</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHEN8</name>
              <description>FE notch enable for index 8</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FENOTCHFILT4</name>
          <description>No Description</description>
          <addressOffset>0x140</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3FFF3FFF</resetMask>
          <fields>
            <field>
              <name>FENOTCHATTNSEL9</name>
              <description>FE Notch attn sel code for index 9</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPCRSE9</name>
              <description>FE Notch coarse cap code for index 9</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPFINE9</name>
              <description>FE Notch fine cap code for index 9</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHRATTNEN9</name>
              <description>FE notch rattn enable for index 9</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHEN9</name>
              <description>FE notch enable for index 9</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHATTNSEL10</name>
              <description>FE Notch attn sel code for index 10</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPCRSE10</name>
              <description>FE Notch coarse cap code for index 10</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPFINE10</name>
              <description>FE Notch fine cap code for index 10</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHRATTNEN10</name>
              <description>FE notch rattn enable for index 10</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHEN10</name>
              <description>FE notch enable for index 10</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FENOTCHFILT5</name>
          <description>No Description</description>
          <addressOffset>0x144</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3FFF3FFF</resetMask>
          <fields>
            <field>
              <name>FENOTCHATTNSEL11</name>
              <description>FE Notch attn sel code for index 11</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPCRSE11</name>
              <description>FE Notch coarse cap code for index 11</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPFINE11</name>
              <description>FE Notch fine cap code for index 11</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHRATTNEN11</name>
              <description>FE notch rattn enable for index 11</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHEN11</name>
              <description>FE notch enable for index 11</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHATTNSEL12</name>
              <description>FE Notch attn sel code for index 12</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPCRSE12</name>
              <description>FE Notch coarse cap code for index 12</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPFINE12</name>
              <description>FE Notch fine cap code for index 12</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHRATTNEN12</name>
              <description>FE notch rattn enable for index 12</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHEN12</name>
              <description>FE notch enable for index 12</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FENOTCHFILT6</name>
          <description>No Description</description>
          <addressOffset>0x148</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x3FFF3FFF</resetMask>
          <fields>
            <field>
              <name>FENOTCHATTNSEL13</name>
              <description>FE Notch attn sel code for index 13</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPCRSE13</name>
              <description>FE Notch coarse cap code for index 13</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPFINE13</name>
              <description>FE Notch fine cap code for index 13</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHRATTNEN13</name>
              <description>FE notch rattn enable for index 13</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHEN13</name>
              <description>FE notch enable for index 13</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHATTNSEL14</name>
              <description>FE Notch attn sel code for index 14</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPCRSE14</name>
              <description>FE Notch coarse cap code for index 14</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPFINE14</name>
              <description>FE Notch fine cap code for index 14</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHRATTNEN14</name>
              <description>FE notch rattn enable for index 14</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHEN14</name>
              <description>FE notch enable for index 14</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FENOTCHFILT7</name>
          <description>No Description</description>
          <addressOffset>0x14C</addressOffset>
          <access>read-write</access>
          <resetValue>0x20080000</resetValue>
          <resetMask>0x3FFF3FFF</resetMask>
          <fields>
            <field>
              <name>FENOTCHATTNSEL15</name>
              <description>FE Notch attn sel code for index 15</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPCRSE15</name>
              <description>FE Notch coarse cap code for index 15</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPFINE15</name>
              <description>FE Notch fine cap code for index 15</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHRATTNEN15</name>
              <description>FE notch rattn enable for index 15</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHEN15</name>
              <description>FE notch enable for index 15</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHATTNSEL16</name>
              <description>FE Notch attn sel code for index 16</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPCRSE16</name>
              <description>FE Notch coarse cap code for index 16</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPFINE16</name>
              <description>FE Notch fine cap code for index 16</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHRATTNEN16</name>
              <description>FE notch rattn enable for index 16</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHEN16</name>
              <description>FE notch enable for index 16</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FENOTCHFILT8</name>
          <description>No Description</description>
          <addressOffset>0x150</addressOffset>
          <access>read-write</access>
          <resetValue>0x200B200A</resetValue>
          <resetMask>0x3FFF3FFF</resetMask>
          <fields>
            <field>
              <name>FENOTCHATTNSEL17</name>
              <description>FE Notch attn sel code for index 17</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPCRSE17</name>
              <description>FE Notch coarse cap code for index 17</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPFINE17</name>
              <description>FE Notch fine cap code for index 17</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHRATTNEN17</name>
              <description>FE notch rattn enable for index 17</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHEN17</name>
              <description>FE notch enable for index 17</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHATTNSEL18</name>
              <description>FE Notch attn sel code for index 18</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPCRSE18</name>
              <description>FE Notch coarse cap code for index 18</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHCAPFINE18</name>
              <description>FE Notch fine cap code for index 18</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHRATTNEN18</name>
              <description>FE notch rattn enable for index 18</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FENOTCHEN18</name>
              <description>FE notch enable for index 18</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
